<script lang="ts" setup>
import {ref} from "vue";

const agreementDialogVisible = ref(false);

function openUserAgreementDialog(){
  agreementDialogVisible.value = true;
}

defineExpose({ openUserAgreementDialog });
</script>

<template>
  <el-dialog v-model="agreementDialogVisible" title="用户协议" width="650">
    <div class="content">
      <h2>第一部分：引言</h2>
      欢迎使用 [微服务编排平台Juggle]（以下简称“本软件”）。本协议由 [Juggle作者]（以下简称“我们”）与您（“用户”或“您”）共同签订。在您开始使用本软件之前，请仔细阅读以下条款，一旦您开始使用本软件，则视为您已阅读、理解并同意遵守以下所有条款。

      <h2>第二部分：使用条款</h2>
      <h3>1.合法使用</h3>
      <ul>
        <li>用户承诺在使用本软件的过程中，将遵守所有适用的法律法规，包括但不限于国家法律法规、地方性法规以及国际公约。</li>
        <li>用户不得利用本软件从事任何违法、违规的行为，包括但不限于传播非法内容、侵犯他人知识产权、散布恶意软件等。</li>
      </ul>

      <h3>2.禁止非法倒卖</h3>
      <ul>
        <li>用户不得未经许可将本软件或其任何部分用于商业目的，特别是不得非法复制、销售、出租、转让或以任何形式进行非法倒卖。</li>
        <li>用户不得未经许可，不得将本软件提供的付费资产，包括但不限于付费套件，付费模板等以任何形式进行非法倒卖。</li>
        <li>本软件仅供个人和公司内部使用，未经我们同意，不得用于商业用途。</li>
      </ul>

      <h3>3.用户行为规范</h3>
      <ul>
        <li>用户在使用本软件过程中应当尊重其他用户的合法权益，不得采取任何损害他人利益的行为。</li>
        <li>用户不得滥用本软件提供的功能，包括但不限于发送垃圾邮件、实施网络攻击、进行欺诈活动等。</li>
        <li>用户不得使用任何自动化工具或程序对本软件进行操作。</li>
        <li>用户在本软件中购买的付费资产，如：套件，模板等，只能在当前环境生效，其他平台或环境需要重新购买。</li>
      </ul>

      <h3>4.隐私保护</h3>
      <ul>
        <li>用户同意我们有权收集、使用及保护用户在使用本软件过程中提供的个人信息。</li>
        <li>用户应妥善保管自己的账号信息，不得将账号泄露给第三方，因用户自身原因造成的损失由用户自行承担。</li>
      </ul>

      <h3>5.责任限制</h3>
      <ul>
        <li>我们不对因用户违反本协议而导致的任何直接或间接损失承担责任。</li>
        <li>对于超出我们控制范围内的因素所导致的服务中断或故障，我们不承担任何责任。</li>
        <li>对于在平台购买的付费套件，套件中涉及的接口的性能和稳定性，我们不负责，如果需要更强的性能和稳定性，请联系我们私有化部署本软件。</li>
      </ul>

      <h3>6.终止服务</h3>
      <ul>
        <li>若用户违反本协议中的任何条款，我们有权立即终止用户使用本软件的权限。</li>
        <li>我们保留在不事先通知的情况下，因维护、升级或其他原因暂停或终止服务的权利。</li>
      </ul>

      <h3>7.修改与更新</h3>
      <ul>
        <li>我们保留随时修改本协议条款的权利，一旦修改生效，将通过发版日志等方式适当通知用户。</li>
        <li>用户有义务定期查看最新的用户协议文本，继续使用本软件即视为同意最新的协议条款。</li>
      </ul>

      <h2>第三部分：其他条款</h2>
      <h3>1.法律适用与争议解决</h3>
      <ul>
        <li>本协议的解释和执行均适用中华人民共和国法律。</li>
        <li>因本协议引起的任何争议，双方应友好协商解决；协商不成时，任何一方均可向本公司所在地人民法院提起诉讼。</li>
      </ul>
    </div>
  </el-dialog>
</template>

<style lang="less" scoped>
.content{
  line-height: 25px;
  h2 {
    margin-bottom: 5px;
  }
}
</style>